<?php
/* カタカナ限定で高速化したもの */
function getSyllabary($str) {
  $charset = 'utf-8';
  if (empty($str)) {
    return false;
  }
  $dic = array(
    'ア' => 'ア', 'イ' => 'ア', 'ウ' => 'ア', 'エ' => 'ア', 'オ' => 'ア',
    'カ' => 'カ', 'キ' => 'カ', 'ク' => 'カ', 'ケ' => 'カ', 'コ' => 'カ',
    'ガ' => 'カ', 'ギ' => 'カ', 'グ' => 'カ', 'ゲ' => 'カ', 'ゴ' => 'カ',
    'サ' => 'サ', 'シ' => 'サ', 'ス' => 'サ', 'セ' => 'サ', 'ソ' => 'サ',
    'ザ' => 'サ', 'ジ' => 'サ', 'ズ' => 'サ', 'ゼ' => 'サ', 'ゾ' => 'サ',
    'タ' => 'タ', 'チ' => 'タ', 'ツ' => 'タ', 'テ' => 'タ', 'ト' => 'タ',
    'ダ' => 'タ', 'ヂ' => 'タ', 'ヅ' => 'タ', 'デ' => 'タ', 'ド' => 'タ',
    'ナ' => 'ナ', 'ニ' => 'ナ', 'ヌ' => 'ナ', 'ネ' => 'ナ', 'ノ' => 'ナ',
    'ハ' => 'ハ', 'ヒ' => 'ハ', 'フ' => 'ハ', 'ヘ' => 'ハ', 'ホ' => 'ハ',
    'バ' => 'ハ', 'ビ' => 'ハ', 'ブ' => 'ハ', 'ベ' => 'ハ', 'ボ' => 'ハ',
    'パ' => 'ハ', 'ピ' => 'ハ', 'プ' => 'ハ', 'ペ' => 'ハ', 'ポ' => 'ハ',
    'マ' => 'マ', 'ミ' => 'マ', 'ム' => 'マ', 'メ' => 'マ', 'モ' => 'マ',
    'ヤ' => 'ヤ', 'ユ' => 'ヤ', 'ヨ' => 'ヤ',
    'ラ' => 'ラ', 'リ' => 'ラ', 'ル' => 'ラ', 'レ' => 'ラ', 'ロ' => 'ラ',
    'ワ' => 'ワ', 'ヲ' => 'ワ', 'ン' => 'ワ',
  );
  $head = mb_substr(trim($str), 0, 1, $charset);
  if (!empty($dic[$head])) {
    return $dic[$head];
  }
}

function getGroupBySyllabary($targets, $kana_key) {
  $syllabary_items = [];

  foreach ($targets as $key => $target) {
    $syllabary_items[getSyllabary($target->$kana_key)][] = $target;
  }

  return $syllabary_items;
}